# 1. 데이터 프레임 생성

In [1]:
import pandas as pd

- Dict를 통한 데이터 프레임 생성

In [5]:
df = pd.DataFrame({'a':[1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [8]:
dummy = ({'a':[1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})

In [33]:
df2 = pd.DataFrame(dummy)
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

- List를 이용한 데이터 프레임 생성

In [30]:
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [31]:
df3 = pd.DataFrame(a)
df3

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [32]:
## columns의 이름 설정
df3.columns = ['a', 'b', 'c']
df3

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

- 문제: company 열에 abc, 회사, 123을 직원수 열에 400, 10, 6으로 된 데이터 프레임을 만드시오

In [19]:
## 이 문제를 통해 여러가지 타입의 변수가 들어가도 되는지 확인하고자 함
a = {'company':['abc', '회사', 123], '직원수':[400, 10, 6]}

In [21]:
df4 = pd.DataFrame(a)
df4

  company  직원수
0     abc  400
1      회사   10
2     123    6

- 문제: company 열에 abc, 회사, 123을 직원수 열에 400, 10, 6, 위치 행에 Seoul, NaN, Busan으로 된 데이터 프레임을 만드시오

In [22]:
a = {'company':['abc', '회사', 123], '직원수':[400, 10, 6], '위치':['Seoul', NaN, 'Busan']}

NameError: name 'NaN' is not defined

In [23]:
a = {'company':['abc', '회사', 123], '직원수':[400, 10, 6], '위치':['Seoul', , 'Busan']}

SyntaxError: invalid syntax (Temp/ipykernel_13228/25890166.py, line 1)

In [24]:
# 위와 같이 하면 에러가 발생 -> numpy를 통해 해결
import numpy as np

In [25]:
a = {'company':['abc', '회사', 123], '직원수':[400, 10, 6], '위치':['Seoul', np.NaN, 'Busan']}

In [27]:
df5 = pd.DataFrame(a)
df5

  company  직원수     위치
0     abc  400  Seoul
1      회사   10    NaN
2     123    6  Busan

# 2. 칼럼명 추출/변경

- 데이터 프레임 생성

In [34]:
df = pd.DataFrame({'a': [1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

- 칼럼명 얻기

In [36]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [37]:
df.columns[1]

'b'

- 문제: 칼럼명인 a,b,c를 d,e,f로 바꾸어라

-치환을 통한 칼럼명 변경

In [38]:
df.columns = ['d', 'e', 'f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

- 문제: 칼럼명인 d,e,f 중 d를 '디'로 'f'를 '에프'로 바꾸어라

In [40]:
df.columns = ['디', 'e', '에프']
df
## columns이 많은데 그중 하나만 바꾸고 싶은 경우에는 비효율적일 수 있음 그래서 rename을 사용함

   디  e  에프
0  1  4   7
1  2  5   8
2  3  6   9

- rename을 통한 칼럼명 변경

In [45]:
# 데이터 프레임 재생성
df = pd.DataFrame({'a': [1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})
df.columns = ['d', 'e', 'f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [47]:
df.rename(columns = {'d':'디', 'f':'에프'})

   디  e  에프
0  1  4   7
1  2  5   8
2  3  6   9

In [48]:
# 하지만 df를 입력하면 바꾸어져 있지 않음
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [51]:
# inplace=True를 통해 원래의 값도 변경되게 해줌
df.rename(columns = {'d':'디', 'f':'에프'}, inplace=True)
df

   디  e  에프
0  1  4   7
1  2  5   8
2  3  6   9

# 3. copy를 이용한 데이터 복사

- 데이터 생성

In [52]:
df = pd.DataFrame({'a': [1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})

- 문제: 필드명을 a,b,c에서 d,e,f로 변경하시오

In [53]:
df.columns=['d', 'e', 'f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

- 문제: 필드명 a를 '에이'로 변경하시오

In [54]:
df = pd.DataFrame({'a': [1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})

In [56]:
df.rename(columns={'a':'에이'}, inplace=True)
df

   에이  b  c
0   1  4  7
1   2  5  8
2   3  6  9

- 변수명을 복제하여 해결??

In [57]:
df = pd.DataFrame({'a': [1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})
df2=df

In [58]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [59]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

- 문제: 필드명을 a,b,c에서 d,e,f로 변경하시오

In [60]:
df.columns=['d', 'e','f']

In [61]:
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [62]:
df2
# df2는 바뀌면 안되는데 바뀌어짐

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

- deep copy를 통한 해결

In [63]:
import copy

In [64]:
df = pd.DataFrame({'a': [1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})
df2 = copy.deepcopy(df)

In [65]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [66]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [67]:
df.columns=['d','e','f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [68]:
df2
## df2는 그대로임

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

# 4. 시리즈

- 데이터 생성

In [70]:
df = pd.DataFrame({'a': [1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

- a열을 추출하시오

In [71]:
df['a']
## 리스트와 다른점은 인덱싱 번호가 따로 주어진다는 점

0    1
1    2
2    3
Name: a, dtype: int64

In [72]:
type(df['a'])

pandas.core.series.Series

- 시리즈 생성 방법

In [73]:
a = pd.Series([1, 2, 3, 1, 2, 3])
a

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

- 인덱스 변경

In [74]:
a = pd.Series([1, 2, 3, 1, 2, 3], index = ['a', 'b', 'c', 'd', 'e', 'f'])
a

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64

In [75]:
a['e']

2

- 유일한 값 찾기

-아래 테이블(df)의 a 필드의 값들 중 유일한 것들만 추출하시오

In [77]:
df = pd.DataFrame({'a': [1, 2, 3, 1, 2, 3], 'b':[4, 5, 6, 6, 7, 8], 'c':[7, 8, 9, 10, 11, 12]})

In [79]:
a = df['a']
a

0    1
1    2
2    3
3    1
4    2
5    3
Name: a, dtype: int64

In [80]:
type(a)

pandas.core.series.Series

In [82]:
a.unique()

array([1, 2, 3], dtype=int64)

In [83]:
a.unique()[2]

3

- 문제: a, b 열을 추출하시오

-시리즈는 a, b를 동시에 못 가지는데 실제로 그런지 확인

In [85]:
df = pd.DataFrame({'a': [1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [86]:
df['a', 'b']
## 시리즈를 만들기 위해서는 하나씩 만들어줘야함

KeyError: ('a', 'b')